application/app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["content", "g"], ["post_id", 3], ["created_at", "2024-05-24 12:32:16.217158"], ["updated_at", "2024-05-24 12:32:16.217158"], ["user_id", 4]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(comment_params)
    @comment.user_id = current_user.id if user_signed_in?

    if @comment.save