application/app/controllers/pages_controller.rb

  def find
    if params[:title].present?
      query = {
        query: {
          match: {
            title: {
              query: params[:title].downcase,
              operator: "and"
            }
          }
        }
      }
    else
      query = {
        query: {
          match_none: {} # Explicitly state that no posts should be returned
        }
      }
    end

    begin
      @posts = Post.search(query).page(params[:page]).per(10).records
---
SELECT "posts".* FROM "posts" WHERE (title LIKE '%%') LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE (title LIKE '%%')