application/app/controllers/posts_controller.rb

  def list
    @posts = Post.page(params[:page]).per(10)
---
SELECT "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def index
    @posts = Post.page(params[:page]).per(10)
---
SELECT "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def show
    @comments = @post.comments.page(params[:page]).per(10)
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]

  def download_pdf
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hi psql"], ["content", "psql"], ["created_at", "2024-07-29 10:32:22.562678"], ["updated_at", "2024-07-29 10:32:22.562678"], ["user_id", 1]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Test "], ["content", "something\n\nedit"], ["updated_at", "2024-05-22 08:35:38.887061"], ["id", 1]]