app/views/pages/home.html.erb

SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ? AND (((roles.name = 'admin') AND (roles.resource_type IS NULL) AND (roles.resource_id IS NULL)))  [["user_id", 3]]
SELECT COUNT(*) FROM "users"
---
  <p>Cześć <%= current_user.email %></p><br>
  <p>Twoje role: <%= current_user.roles.map(&:name).join(", ") %></p><br>
  <% if current_user.has_role?(:admin) %>
    <p>Liczba wszystkich użytkowników: <%= User.count %></p>