app/views/pages/home.html.erb

  <p>Hello <%= current_user.email %></p><br>
  <p>You have roles: <%= current_user.roles.map(&:name).join(", ") %></p><br>
  <% if current_user.has_role?(:admin) %>
    <p>User Total count: <%= User.count %></p>
---
SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "users"