app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 6]]
SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = ? LIMIT ? OFFSET ?  [["post_id", 4], ["LIMIT", 1], ["OFFSET", 10]]
---
      </div>
      <% if @post.comments.any? %>
        <div class="comment-section rounded border p-4 bg-light mb-4" style="max-height: 300px; overflow-y: auto;">
          <% @post.comments.each do |comment| %>