app/views/posts/show.html.erb

      </div>
      <% if @post.comments.any? %>
        <div class="comment-section rounded border p-4 bg-light mb-4" style="max-height: 300px; overflow-y: auto;">
          <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 5]]
SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = ? LIMIT ?  [["post_id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 6]]