app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["content", "13"], ["post_id", 4], ["created_at", "2024-05-27 21:37:00.600584"], ["updated_at", "2024-05-27 21:37:00.600584"], ["user_id", 3]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(comment_params)
    @comment.comment_author = params[:comment][:comment_author]  # Set the comment_author from params
    @comment.timestamp = Time.now  # Set the timestamp to the current time

    if @comment.save