app/controllers/pages_controller.rb

  def find
    @posts = Post.where("title LIKE ?", "%#{params[:title]}%").page(params[:page]).per(10)
---
SELECT "posts".* FROM "posts" WHERE (title LIKE '%%') LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE (title LIKE '%%')