app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "test"], ["content", "2"], ["created_at", "2024-05-24 12:26:08.707615"], ["updated_at", "2024-05-24 12:26:08.707615"], ["user_id", 4]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Test "], ["content", "something\n\nedit"], ["updated_at", "2024-05-22 08:35:38.887061"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)