app/controllers/posts_controller.rb

SELECT COUNT(*) FROM "posts"
SELECT "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @posts = Post.page(params[:page]).per(10)

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? LIMIT ? OFFSET ?  [["post_id", 3], ["LIMIT", 10], ["OFFSET", 0]]
---
  def show
    @comments = @post.comments.page(params[:page]).per(10)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def download_pdf
    Rails.logger.info "****************************************"
    Rails.logger.info "Entering download_pdf method"
    @post = Post.find(params[:id])